Revit 2024 API
AssetPropertyDoubleArray4d.GetValueAsDoubles Method
 Gets the value property as doubles.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public IList<double> GetValueAsDoubles()
Visual Basic
Public Function GetValueAsDoubles As IList(Of Double)
Visual C++
public:
IList<double>^ GetValueAsDoubles()
Return Value
 The value as doubles.
See Also
AssetPropertyDoubleArray4d Class
Autodesk.Revit.DB.Visual Namespace